Transmitter/src/Catalogs/ExternalRequestHandlers/ExternalRequestHandlers.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ExternalRequestHandlers</name>
  <attributes>
    <name>ProjectURL</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SecretToken</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>EventsHistory</name>
    <attributes>
      <name>Date</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Action</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Level</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Event</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>HTTPStatusCode</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>DataPresentation</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ApplicationPresentation</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>UserName</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Comment</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Transmitter/src/Catalogs/ExternalRequestHandlers/ManagerModule.bsl
#Region Public

// FindByURL returns the search result by URL from records not marked for deletion.
// 
// Parameters:
// 	URL - String - remote project URL;
// 	
// Returns:
// 	ValueTable - search result:
// 	* Ref - CatalogRef.ExternalRequestHandlers - ref to external request handler;
// 	* SecretToken - String - remote repository token;
//
Function FindByURL( Val URL ) Export
	
	Var Query;
	
	If ( TypeOf(URL) <> Type("String") ) Then
		
		Return New Array();
		
	EndIf;
	
	Query = New Query();
	Query.SetParameter( "URL", URL );
	Query.Text = 	"SELECT
					|	ExternalRequestHandlers.Ref AS Ref,
					|	ExternalRequestHandlers.SecretToken AS SecretToken
					|FROM
					|	Catalog.ExternalRequestHandlers AS ExternalRequestHandlers
					|WHERE
					|	NOT ExternalRequestHandlers.DeletionMark
					|	AND ExternalRequestHandlers.ProjectURL = &URL";
	
	Return Query.Execute().Unload();
	
EndFunction

#EndRegion
